fonecmid-diplom/src/InformationRegisters/ВКМ_Календарь/ВКМ_Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_Календарь</name>
  <informationRegisterPeriodicity>Nonperiodical</informationRegisterPeriodicity>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_Календарь</schedule>
  <scheduleValue>InformationRegister.ВКМ_Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_Календарь</schedule>
  <scheduleValue>InformationRegister.ВКМ_Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_РасчетЗарплаты/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет регистр сведений ВКМ_Календарь на указанный год (пн–пт — рабочие дни).
//
// Параметры:
//  Год - Число - календарный год.
//
Процедура ЗаполнитьКалендарь(Год) Экспорт
	
	НачалоГода = Дата(Год, 1, 1);
	КонецГода = Дата(Год, 12, 31);
	
	ТекущаяДата = НачалоГода;
	Пока ТекущаяДата <= КонецГода Цикл
		
		ДеньНедели = ДеньНедели(ТекущаяДата);
		РабочийДень = ?(ДеньНедели >= 1 И ДеньНедели <= 5, 1, 0);
		
		МенеджерЗаписи = РегистрыСведений.ВКМ_Календарь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Дата = ТекущаяДата;
		МенеджерЗаписи.РабочийДень = РабочийДень;
		МенеджерЗаписи.Записать();
		
		ТекущаяДата = ТекущаяДата + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает условия оплаты сотрудника на дату среза.
//
Функция ПолучитьУсловияОплатыСотрудника(Сотрудник, ДатаСреза) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Условия.Оклад КАК Оклад,
	|	Условия.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|		&ДатаСреза,
	|		Сотрудник = &Сотрудник) КАК Условия";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЕстьУсловия, Оклад, ПроцентОтРабот", Истина, Выборка.Оклад, Выборка.ПроцентОтРабот);
	КонецЕсли;
	
	Возврат Новый Структура("ЕстьУсловия, Оклад, ПроцентОтРабот", Ложь, 0, 0);
	
КонецФункции

// Возвращает сумму начислений за выполненные работы за период.
//
Функция ПолучитьСуммуОтРаботЗаПериод(Сотрудник, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Обороты.СуммаКОплатеОборот), 0) КАК СуммаОтРабот
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|		&НачалоПериода,
	|		&КонецПериода,
	|		,
	|		Сотрудник = &Сотрудник) КАК Обороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОтРабот;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Рассчитывает оклад по данным графика регистра расчета (с учетом вытеснения).
//
Функция РассчитатьОкладПоГрафикуРегистра(Регистратор, Сотрудник, Оклад) Экспорт
	
	Отбор = Новый Структура("Регистратор, Сотрудник", Регистратор, Сотрудник);
	ДанныеГрафика = РегистрыРасчета.ВКМ_ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ПериодДействия);
	Норма = ?(ДанныеГрафика.Количество() > 0, ДанныеГрафика[0].РабочийДень, 0);
	
	ДанныеФакт = РегистрыРасчета.ВКМ_ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ФактическийПериодДействия);
	Факт = ?(ДанныеФакт.Количество() > 0, ДанныеФакт[0].РабочийДень, 0);
	
	Возврат ?(Норма = 0, 0, Окр(Оклад * Факт / Норма, 2));
	
КонецФункции

// Возвращает соответствие Сотрудник -> сумма начислений по регистратору (для НДФЛ).
//
Функция ПолучитьСуммуНачисленийОсновныеПоСотрудникам(Регистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	СУММА(Начисления.Результат) КАК СуммаБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Сотрудник, Выборка.СуммаБаза);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет результат НДФЛ в движениях удержаний по сумме основных начислений документа-регистратора.
//
Процедура РассчитатьНДФЛПоБазеОсновныхНачислений(ДвиженияУдержания, Регистратор, ВидРасчетаНДФЛ = Неопределено) Экспорт
	
	РассчитатьНДФЛПоБазеНачислений(ДвиженияУдержания, ПолучитьСуммуНачисленийОсновныеПоСотрудникам(Регистратор));
	
КонецПроцедуры

// Возвращает соответствие Сотрудник -> сумма дополнительных начислений по регистратору.
//
Функция ПолучитьСуммуНачисленийДополнительныеПоСотрудникам(Регистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	СУММА(Начисления.Результат) КАК СуммаБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Сотрудник, Выборка.СуммаБаза);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет результат НДФЛ в движениях удержаний по сумме дополнительных начислений документа-регистратора.
//
Процедура РассчитатьНДФЛПоБазеДополнительныхНачислений(ДвиженияУдержания, Регистратор) Экспорт
	
	РассчитатьНДФЛПоБазеНачислений(ДвиженияУдержания, ПолучитьСуммуНачисленийДополнительныеПоСотрудникам(Регистратор));
	
КонецПроцедуры

Процедура РассчитатьНДФЛПоБазеНачислений(ДвиженияУдержания, БазаПоСотрудникам)
	
	Для Каждого Движение Из ДвиженияУдержания Цикл
		СуммаБаза = 0;
		ЗначениеБазы = БазаПоСотрудникам.Получить(Движение.Сотрудник);
		Если ЗначениеБазы <> Неопределено Тогда
			СуммаБаза = ЗначениеБазы;
		КонецЕсли;
		Движение.Результат = РассчитатьНДФЛ(СуммаБаза);
	КонецЦикла;
	
КонецПроцедуры

// Рассчитывает НДФЛ от суммы начислений (13%).
//
Функция РассчитатьНДФЛ(СуммаНачислений) Экспорт
	Возврат Окр(СуммаНачислений * 0.13, 2);
КонецФункции

#КонецОбласти

#КонецЕсли
